// z 모양 테트리스 블록 만들기
#define _CRT_SECURE_NO_WARNINGS
#include <stdio.h>

int main() {
	int num;
	char arr[4][4][4] = {
		{
			{' ',' ',' ',' '},
			{'*','*',' ',' '},
			{' ','*','*',' '},
			{' ',' ',' ',' '}
		},
		{
			{' ',' ','*',' '},
			{' ','*','*',' '},
			{' ','*',' ',' '},
			{' ',' ',' ',' '}
		},
		{
			{' ',' ',' ',' '},
			{'*','*',' ',' '},
			{' ','*','*',' '},
			{' ',' ',' ',' '}
		},
		{
			{' ',' ','*',' '},
			{' ','*','*',' '},
			{' ','*',' ',' '},
			{' ',' ',' ',' '}
		}
	};

	//for (int h = 0; h < 4; h++) {
	//	for (int i = 0; i < 4; i++) {
	//		for (int j = 0; j < 4; j++) {
	//			if ((h % 2) == 0 && i == 1 && j < 2) arr[h][i][j] = '*';
	//			else if ((h % 2) == 0 && i == 2 && j > 0 && j < 3) arr[h][i][j] = '*';
	//			else if ((h % 2) == 1 && j == 2 && i < 2) arr[h][i][j] = '*';
	//			else if ((h % 2) == 1 && j == 1 && i > 0 && i < 3) arr[h][i][j] = '*';
	//			else arr[h][i][j] = ' ';
	//		}
	//	}
	//}

	while (true) {
		scanf("%d", &num);
		if (num == 0) break;
		for (int i = 0; i < 4; i++) {
			for (int j = 0; j < 4; j++) {
				printf("%c", arr[num - 1][i][j]);
			}
			printf("\n");
		}
	}

}